# Data Cleaning and Preparation

In [1]:
import numpy as np

In [2]:
import pandas as pd

## Handling Missing Data

In [3]:
# NaN(Not a Number)
float_data = pd.Series([1.34, 5.89, np.nan, 3.14, 0.991])

In [4]:
float_data

0    1.340
1    5.890
2      NaN
3    3.140
4    0.991
dtype: float64

In [5]:
# checking whether data at index is NaN or not using isna() function
float_data.isna()

0    False
1    False
2     True
3    False
4    False
dtype: bool

In [6]:
# we can also drop missing values(NaN) using dropna() function
float_data.dropna()

0    1.340
1    5.890
3    3.140
4    0.991
dtype: float64

In [7]:
# we can also fill NaN using fillna() it uses interpolation methods
float_data.ffill()

0    1.340
1    5.890
2    5.890
3    3.140
4    0.991
dtype: float64

In [8]:
float_data.bfill()

0    1.340
1    5.890
2    3.140
3    3.140
4    0.991
dtype: float64

## Filtering Out Missing Data

In [9]:
frame_data = pd.DataFrame([[1, np.nan, np.nan], [np.nan, -1, 3], [2, np.nan, np.nan], [3, -10, 4]])

In [10]:
frame_data

     0     1    2
0  1.0   NaN  NaN
1  NaN  -1.0  3.0
2  2.0   NaN  NaN
3  3.0 -10.0  4.0

In [11]:
# by default dropna() drops anu row contaning a missing value
frame_data.dropna()

     0     1    2
3  3.0 -10.0  4.0

In [12]:
# how='all'
frame_data.dropna(how='all')

     0     1    2
0  1.0   NaN  NaN
1  NaN  -1.0  3.0
2  2.0   NaN  NaN
3  3.0 -10.0  4.0

In [13]:
frame_data[3] = [2, 4, 6, 9]

In [14]:
frame_data

     0     1    2  3
0  1.0   NaN  NaN  2
1  NaN  -1.0  3.0  4
2  2.0   NaN  NaN  6
3  3.0 -10.0  4.0  9

In [15]:
frame_data[4] = np.nan
frame_data

     0     1    2  3   4
0  1.0   NaN  NaN  2 NaN
1  NaN  -1.0  3.0  4 NaN
2  2.0   NaN  NaN  6 NaN
3  3.0 -10.0  4.0  9 NaN

In [16]:
# now dropping the 4th column using axis="column" and how='all'
frame_data.dropna(axis='columns', how='all')

     0     1    2  3
0  1.0   NaN  NaN  2
1  NaN  -1.0  3.0  4
2  2.0   NaN  NaN  6
3  3.0 -10.0  4.0  9

In [17]:
df = pd.DataFrame(np.random.standard_normal((7,5)))

In [18]:
df

          0         1         2         3         4
0  0.281235  0.712994 -0.891882 -0.905315  1.017760
1  0.443799 -2.055020 -0.093014 -0.533116  1.018923
2 -0.476525  0.935469  0.459412  0.003055  1.403704
3 -0.302741 -0.269435  1.092117 -1.667003  0.418288
4 -0.092295 -0.058803 -0.832216  1.550413 -1.151841
5 -0.427180  1.293834 -0.958444 -0.775810 -0.842619
6  0.004380  1.500157  1.451701  0.862641  0.587073

In [19]:
# now suppose in 'df' we want to keep certain positions missing so
df.iloc[1:3, 1] = np.nan
df.iloc[:5, 4] = np.nan

In [20]:
df

          0         1         2         3         4
0  0.281235  0.712994 -0.891882 -0.905315       NaN
1  0.443799       NaN -0.093014 -0.533116       NaN
2 -0.476525       NaN  0.459412  0.003055       NaN
3 -0.302741 -0.269435  1.092117 -1.667003       NaN
4 -0.092295 -0.058803 -0.832216  1.550413       NaN
5 -0.427180  1.293834 -0.958444 -0.775810 -0.842619
6  0.004380  1.500157  1.451701  0.862641  0.587073

In [21]:
df.dropna()

         0         1         2         3         4
5 -0.42718  1.293834 -0.958444 -0.775810 -0.842619
6  0.00438  1.500157  1.451701  0.862641  0.587073

## Filling in Missing Data

In [23]:
# filling 0 at NaN places
df.fillna(0)

          0         1         2         3         4
0  0.281235  0.712994 -0.891882 -0.905315  0.000000
1  0.443799  0.000000 -0.093014 -0.533116  0.000000
2 -0.476525  0.000000  0.459412  0.003055  0.000000
3 -0.302741 -0.269435  1.092117 -1.667003  0.000000
4 -0.092295 -0.058803 -0.832216  1.550413  0.000000
5 -0.427180  1.293834 -0.958444 -0.775810 -0.842619
6  0.004380  1.500157  1.451701  0.862641  0.587073

# Data Transformation

## Removing Duplicates

In [36]:
students = pd.DataFrame({"names":["Lucky", "Ayan", "Henry", "Dishu", "Ayan", "Lucky", "Henry", "Lucky", "Ayan", "Dishu"],
                         "number":[90, 89, 67, 100, 69, 90, 67, 86, 89, 100]})

In [37]:
students

   names  number
0  Lucky      90
1   Ayan      89
2  Henry      67
3  Dishu     100
4   Ayan      69
5  Lucky      90
6  Henry      67
7  Lucky      86
8   Ayan      89
9  Dishu     100

In [38]:
# duplicate() method
students.duplicated()

0    False
1    False
2    False
3    False
4    False
5     True
6     True
7    False
8     True
9     True
dtype: bool

In [40]:
students.drop_duplicates()

   names  number
0  Lucky      90
1   Ayan      89
2  Henry      67
3  Dishu     100
4   Ayan      69
7  Lucky      86

## Transforming Data Using a Function or Mapping

In [42]:
ddata = pd.DataFrame({"food":["bacon", "pulled pork", "bacon", "pastrami",
                            "corned beef", "bacon", "pastrami", "honey ham", "nova lox"],
                    "ounces":[4, 3, 5, 1, 2, 6, 4, 2, 6]})

In [43]:
ddata

          food  ounces
0        bacon       4
1  pulled pork       3
2        bacon       5
3     pastrami       1
4  corned beef       2
5        bacon       6
6     pastrami       4
7    honey ham       2
8     nova lox       6

In [44]:
meat_to_animal = {
  "bacon": "pig",
  "pulled pork": "pig",
  "pastrami": "cow",
  "corned beef": "cow",
  "honey ham": "pig",
  "nova lox": "salmon"
}

In [45]:
meat_to_animal

{'bacon': 'pig',
 'pulled pork': 'pig',
 'pastrami': 'cow',
 'corned beef': 'cow',
 'honey ham': 'pig',
 'nova lox': 'salmon'}

In [46]:
# now adding a column using map function
ddata["animal"] = ddata["food"].map(meat_to_animal)

In [47]:
ddata

          food  ounces  animal
0        bacon       4     pig
1  pulled pork       3     pig
2        bacon       5     pig
3     pastrami       1     cow
4  corned beef       2     cow
5        bacon       6     pig
6     pastrami       4     cow
7    honey ham       2     pig
8     nova lox       6  salmon

In [48]:
# adding rank in 'students' using map function
student_rank = {
    "Lucky": 2,
    "Ayan":  3,
    "Henry": 6,
    "Dishu": 1,
    "Ayan":  5,
    "Lucky": 2,
    "Henry": 6,
    "Lucky": 4,
    "Ayan":  3,
    "Dishu": 1
}

In [49]:
student_rank

{'Lucky': 4, 'Ayan': 3, 'Henry': 6, 'Dishu': 1}

In [50]:
students["rank"] = students["names"].map(student_rank)

In [51]:
students

   names  number  rank
0  Lucky      90     4
1   Ayan      89     3
2  Henry      67     6
3  Dishu     100     1
4   Ayan      69     3
5  Lucky      90     4
6  Henry      67     6
7  Lucky      86     4
8   Ayan      89     3
9  Dishu     100     1

In [54]:
students.index

RangeIndex(start=0, stop=10, step=1)

In [55]:
students.reindex(np.arange(10, 20))

   names  number  rank
10   NaN     NaN   NaN
11   NaN     NaN   NaN
12   NaN     NaN   NaN
13   NaN     NaN   NaN
14   NaN     NaN   NaN
15   NaN     NaN   NaN
16   NaN     NaN   NaN
17   NaN     NaN   NaN
18   NaN     NaN   NaN
19   NaN     NaN   NaN

students

## Renaming Axis Indices

In [61]:
frame_2 = pd.DataFrame(np.arange(15).reshape((3, 5)),
                       index=["Delhi", "Surat", "Pune"],
                       columns=["Bus","Car", "Bike", "Scty", "Cycle"])

In [62]:
frame_2

       Bus  Car  Bike  Scty  Cycle
Delhi    0    1     2     3      4
Surat    5    6     7     8      9
Pune    10   11    12    13     14

In [63]:
def transform(x):
    return x.upper()

In [64]:
frame_2.index.map(transform)

Index(['DELHI', 'SURAT', 'PUNE'], dtype='object')

In [65]:
def twiceval(x):
    return 2*x

In [66]:
frame_2["Bus"].map(twiceval)

Delhi     0
Surat    10
Pune     20
Name: Bus, dtype: int64

In [68]:
frame_2["Bus"] = frame_2["Bus"].map(twiceval)

In [69]:
frame_2

       Bus  Car  Bike  Scty  Cycle
Delhi    0    1     2     3      4
Surat   10    6     7     8      9
Pune    20   11    12    13     14

## Discretization and Binning